OpenDTEF-v2012/modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsQMOM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   nonuniform List<scalar> 
3000
(
292.999999889
292.999999886
292.999999884
292.999999883
292.999999882
292.999999883
292.999999883
292.999999883
...
)
;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform 293;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 293;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
